# Pandas

In [1]:
import pandas as pd
import numpy as np

## 1. Pandas基础：Series，DataFrame

### 1.1 Series

In [2]:
s1 = pd.Series([1, 2, 3]) # 创建一个Series，索引为默认值
print(s1)

0    1
1    2
2    3
dtype: int64

In [3]:
s1.values # 查看Series的值

array([1, 2, 3])

In [4]:
s1.index # 查看Series的索引

RangeIndex(start=0, stop=3, step=1)

In [5]:
s2 = pd.Series([1, 2, 3, 4, 4], index=["a", "b", "c", "d", "e"])
print(s2)

a    1
b    2
c    3
d    4
e    4
dtype: int64

In [6]:
s2["e"] # 根据索引提取值

4

In [7]:
s2[["a", "c", "d"]] # 提取多个值，注意使用list形式

a    1
c    3
d    4
dtype: int64

In [8]:
'b' in s2 # 判断索引b是否存在s2中

True

In [9]:
# Series可以看成定长的有序字典
dic1 = {'a1':1, 'a2':2, 'a3':3, 'a4':4, 'a5': 4} # 四个key，四个value
s3 = pd.Series(dic1)
print(s3)

a1    1
a2    2
a3    3
a4    4
a5    4
dtype: int64

### 1.2 DataFrame

In [10]:
data = {
    'year': [2017, 2018, 2019],
    'income': [11, 22, 33],
    'pay': [1, 2, 3]
}
df1 = pd.DataFrame(data) # 使用字典的数据创建DataFrame，未指定索引则为默认索引
print(df1)

   year  income  pay
0  2017      11    1
1  2018      22    2
2  2019      33    3

In [11]:
df2 = pd.DataFrame(np.arange(12).reshape(3, 4)) # 使用Numpy创建DataFrame
print(df2)

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [12]:
df3 = pd.DataFrame(
    np.arange(24).reshape(4, 6), 
    index=[1, 3, 2, 4], 
    columns=['b', 'a', 'c', 'd', 'e', 'f'])
print(df3)

    b   a   c   d   e   f
1   0   1   2   3   4   5
3   6   7   8   9  10  11
2  12  13  14  15  16  17
4  18  19  20  21  22  23

In [13]:
df1.columns # 调用列属性

Index(['year', 'income', 'pay'], dtype='object')

In [14]:
df2.index # 调用行索引

RangeIndex(start=0, stop=3, step=1)

In [15]:
df1.values # 调用值

array([[2017,   11,    1],
       [2018,   22,    2],
       [2019,   33,    3]])

In [16]:
df3.describe() # 显示DataFrame的一些基础统计结果，例如求和，平均，偏差等

               b          a          c          d          e          f
count   4.000000   4.000000   4.000000   4.000000   4.000000   4.000000
mean    9.000000  10.000000  11.000000  12.000000  13.000000  14.000000
std     7.745967   7.745967   7.745967   7.745967   7.745967   7.745967
min     0.000000   1.000000   2.000000   3.000000   4.000000   5.000000
25%     4.500000   5.500000   6.500000   7.500000   8.500000   9.500000
50%     9.000000  10.000000  11.000000  12.000000  13.000000  14.000000
75%    13.500000  14.500000  15.500000  16.500000  17.500000  18.500000
max    18.000000  19.000000  20.000000  21.000000  22.000000  23.000000

In [17]:
df3.T # DataFrame转置

   1   3   2   4
b  0   6  12  18
a  1   7  13  19
c  2   8  14  20
d  3   9  15  21
e  4  10  16  22
f  5  11  17  23

In [18]:
df3.sort_index(axis=1) # axis=1表示对列进行从小到大排序

    a   b   c   d   e   f
1   1   0   2   3   4   5
3   7   6   8   9  10  11
2  13  12  14  15  16  17
4  19  18  20  21  22  23

In [19]:
df3.sort_index(axis=0) # axis=0表示对行进行排序

    b   a   c   d   e   f
1   0   1   2   3   4   5
2  12  13  14  15  16  17
3   6   7   8   9  10  11
4  18  19  20  21  22  23

In [20]:
df3.sort_values(by="a") # 对DataFrame的值进行排列

    b   a   c   d   e   f
1   0   1   2   3   4   5
3   6   7   8   9  10  11
2  12  13  14  15  16  17
4  18  19  20  21  22  23

## 2. Pandas选择数据

In [21]:
dates = pd.date_range('20200221', periods=6) # pands生成时间序列
df1 = pd.DataFrame(
    np.arange(24).reshape(6,4), 
    index=dates, 
    columns=['A', 'B', 'C', 'D'])
print(df1)

             A   B   C   D
2020-02-21   0   1   2   3
2020-02-22   4   5   6   7
2020-02-23   8   9  10  11
2020-02-24  12  13  14  15
2020-02-25  16  17  18  19
2020-02-26  20  21  22  23

In [22]:
type(df1["A"]) # 表中的每个列都可以看成一个Series

pandas.core.series.Series

In [23]:
df1.A # 选择列数据

2020-02-21     0
2020-02-22     4
2020-02-23     8
2020-02-24    12
2020-02-25    16
2020-02-26    20
Freq: D, Name: A, dtype: int64

In [24]:
df1[0:2] # 获取DataFrame的0-1行

            A  B  C  D
2020-02-21  0  1  2  3
2020-02-22  4  5  6  7

In [25]:
df1['20200221':'20200224']

             A   B   C   D
2020-02-21   0   1   2   3
2020-02-22   4   5   6   7
2020-02-23   8   9  10  11
2020-02-24  12  13  14  15

In [26]:
# 通过标签选择数据
df1.loc['2020-02-22']

A    4
B    5
C    6
D    7
Name: 2020-02-22 00:00:00, dtype: int64

In [27]:
df1.loc['2020-02-22', ["A", "D"]] # 第一个位置代表行，第二个位置代表列

A    4
D    7
Name: 2020-02-22 00:00:00, dtype: int64

In [28]:
df1.loc[:, ["A", "C"]] # “:”表示所有行或列

             A   C
2020-02-21   0   2
2020-02-22   4   6
2020-02-23   8  10
2020-02-24  12  14
2020-02-25  16  18
2020-02-26  20  22

In [29]:
df1.iloc[1] # 比loc前面多了一个i，表示index，按照位置选择

A    4
B    5
C    6
D    7
Name: 2020-02-22 00:00:00, dtype: int64

In [30]:
 df1.iloc[0:3, [2,3]] # 按照数字提取行和列，前行后列，如果提取不连续的，使用list即可

             C   D
2020-02-21   2   3
2020-02-22   6   7
2020-02-23  10  11

In [31]:
df1.A > 2 # 将某列的数据提取出来判断值大小

2020-02-21    False
2020-02-22     True
2020-02-23     True
2020-02-24     True
2020-02-25     True
2020-02-26     True
Freq: D, Name: A, dtype: bool

In [32]:
df1[df1.A > 10] # 将A列值大于10的行显示出来

             A   B   C   D
2020-02-24  12  13  14  15
2020-02-25  16  17  18  19
2020-02-26  20  21  22  23

## 3. Pandas赋值及操作

In [33]:
dates = np.arange(20200221, 20200227) # Numpy生成时间序列
df1 = pd.DataFrame(
    np.arange(24).reshape(6,4),
    index=dates, 
    columns=['A', 'B', 'C', 'D'])
print(df1)

           A   B   C   D
20200221   0   1   2   3
20200222   4   5   6   7
20200223   8   9  10  11
20200224  12  13  14  15
20200225  16  17  18  19
20200226  20  21  22  23

In [34]:
df1.iloc[2,2] = 100 # 将三行第三列赋值为100
print(df1)

           A   B    C   D
20200221   0   1    2   3
20200222   4   5    6   7
20200223   8   9  100  11
20200224  12  13   14  15
20200225  16  17   18  19
20200226  20  21   22  23

In [35]:
df1.loc[20200222, 'C'] = 60

In [36]:
df1[df1 > 10] = 0 # 将大于10的数赋值为0
print(df1)

          A  B  C  D
20200221  0  1  2  3
20200222  4  5  0  7
20200223  8  9  0  0
20200224  0  0  0  0
20200225  0  0  0  0
20200226  0  0  0  0

In [37]:
df1.A[df1.A == 0] = 1 # 将A列等于0的值赋值为1
print(df1)

          A  B  C  D
20200221  1  1  2  3
20200222  4  5  0  7
20200223  8  9  0  0
20200224  1  0  0  0
20200225  1  0  0  0
20200226  1  0  0  0

In [38]:
df1['E'] = 10 # 插入一列
print(df1)

          A  B  C  D   E
20200221  1  1  2  3  10
20200222  4  5  0  7  10
20200223  8  9  0  0  10
20200224  1  0  0  0  10
20200225  1  0  0  0  10
20200226  1  0  0  0  10

In [39]:
df1['F'] = pd.Series(range(6), index=dates) # 因为每一列是个Serises所以插入得插Series
print(df1)

          A  B  C  D   E  F
20200221  1  1  2  3  10  0
20200222  4  5  0  7  10  1
20200223  8  9  0  0  10  2
20200224  1  0  0  0  10  3
20200225  1  0  0  0  10  4
20200226  1  0  0  0  10  5

In [40]:
df1.loc[20200227, ['A']]=1 # 插入行
print(df1)

            A    B    C    D     E    F
20200221  1.0  1.0  2.0  3.0  10.0  0.0
20200222  4.0  5.0  0.0  7.0  10.0  1.0
20200223  8.0  9.0  0.0  0.0  10.0  2.0
20200224  1.0  0.0  0.0  0.0  10.0  3.0
20200225  1.0  0.0  0.0  0.0  10.0  4.0
20200226  1.0  0.0  0.0  0.0  10.0  5.0
20200227  1.0  NaN  NaN  NaN   NaN  NaN

In [41]:
s1 = pd.Series(range(6), index=['A','B','C','D','E','F'])
s1.name = 'S1'
df2 = df1.append(s1)
print(df1)

            A    B    C    D     E    F
20200221  1.0  1.0  2.0  3.0  10.0  0.0
20200222  4.0  5.0  0.0  7.0  10.0  1.0
20200223  8.0  9.0  0.0  0.0  10.0  2.0
20200224  1.0  0.0  0.0  0.0  10.0  3.0
20200225  1.0  0.0  0.0  0.0  10.0  4.0
20200226  1.0  0.0  0.0  0.0  10.0  5.0
20200227  1.0  NaN  NaN  NaN   NaN  NaN

In [42]:
df1.insert(1, 'H', df2['E']) # 在df1的第一列插入df2的E列
print(df1)

            A     H    B    C    D     E    F
20200221  1.0  10.0  1.0  2.0  3.0  10.0  0.0
20200222  4.0  10.0  5.0  0.0  7.0  10.0  1.0
20200223  8.0  10.0  9.0  0.0  0.0  10.0  2.0
20200224  1.0  10.0  0.0  0.0  0.0  10.0  3.0
20200225  1.0  10.0  0.0  0.0  0.0  10.0  4.0
20200226  1.0  10.0  0.0  0.0  0.0  10.0  5.0
20200227  1.0   NaN  NaN  NaN  NaN   NaN  NaN

In [43]:
g = df1.pop('H') # 弹出H列
df1.insert(6, 'H', g) # 插入H列在最后
print(df1)

            A    B    C    D     E    F     H
20200221  1.0  1.0  2.0  3.0  10.0  0.0  10.0
20200222  4.0  5.0  0.0  7.0  10.0  1.0  10.0
20200223  8.0  9.0  0.0  0.0  10.0  2.0  10.0
20200224  1.0  0.0  0.0  0.0  10.0  3.0  10.0
20200225  1.0  0.0  0.0  0.0  10.0  4.0  10.0
20200226  1.0  0.0  0.0  0.0  10.0  5.0  10.0
20200227  1.0  NaN  NaN  NaN   NaN  NaN   NaN

In [44]:
del df1['H'] # 删除H列
print(df1)

            A    B    C    D     E    F
20200221  1.0  1.0  2.0  3.0  10.0  0.0
20200222  4.0  5.0  0.0  7.0  10.0  1.0
20200223  8.0  9.0  0.0  0.0  10.0  2.0
20200224  1.0  0.0  0.0  0.0  10.0  3.0
20200225  1.0  0.0  0.0  0.0  10.0  4.0
20200226  1.0  0.0  0.0  0.0  10.0  5.0
20200227  1.0  NaN  NaN  NaN   NaN  NaN

In [51]:
df2 = df1.drop(["A", "B"], axis=1) # 删除两列，axis=1代表删除列
print(df2)

            C    D     E    F
20200221  2.0  3.0  10.0  0.0
20200222  0.0  7.0  10.0  1.0
20200223  0.0  0.0  10.0  2.0
20200224  0.0  0.0  10.0  3.0
20200225  0.0  0.0  10.0  4.0
20200226  0.0  0.0  10.0  5.0
20200227  NaN  NaN   NaN  NaN

In [54]:
df3 = df1.drop([20200227, 20200221], axis=0) # 删除行
print(df3)

            A    B    C    D     E    F
20200222  4.0  5.0  0.0  7.0  10.0  1.0
20200223  8.0  9.0  0.0  0.0  10.0  2.0
20200224  1.0  0.0  0.0  0.0  10.0  3.0
20200225  1.0  0.0  0.0  0.0  10.0  4.0
20200226  1.0  0.0  0.0  0.0  10.0  5.0

## 4. Pandas处理丢失数据

In [62]:
dates = np.arange(20200316, 20200320)
df1 = pd.DataFrame(np.arange(12).reshape((4,3)), index=dates, columns=["A", "B", "C"] )
print(df1)

          A   B   C
20200316  0   1   2
20200317  3   4   5
20200318  6   7   8
20200319  9  10  11

In [64]:
df2 = pd.DataFrame(df1, index=dates, columns=["A", "B", "C", "D", "E"])
print(df2)

          A   B   C   D   E
20200316  0   1   2 NaN NaN
20200317  3   4   5 NaN NaN
20200318  6   7   8 NaN NaN
20200319  9  10  11 NaN NaN

In [69]:
s1 = pd.Series([3,4,6], index=dates[:3])
print(s1)

20200316    3
20200317    4
20200318    6
dtype: int64

In [70]:
s2 = pd.Series([32, 2,2], index=dates[1:])
print(s2)

20200317    32
20200318     2
20200319     2
dtype: int64

In [71]:
df2["D"] = s1
df2["E"] = s2
print(df2)

          A   B   C    D     E
20200316  0   1   2  3.0   NaN
20200317  3   4   5  4.0  32.0
20200318  6   7   8  6.0   2.0
20200319  9  10  11  NaN   2.0

In [76]:
df2.dropna(axis=0, how="any") # 去除含有空值的行，axis=0代表行，1代表列；how可以取两个值，any和all，any代表任意一个，all代表全部

          A  B  C    D     E
20200317  3  4  5  4.0  32.0
20200318  6  7  8  6.0   2.0

In [79]:
df2.dropna(axis=1, how="any")

          A   B   C
20200316  0   1   2
20200317  3   4   5
20200318  6   7   8
20200319  9  10  11

In [82]:
df2.fillna(value=0) # 将所有空值赋值为0

          A   B   C    D     E
20200316  0   1   2  3.0   0.0
20200317  3   4   5  4.0  32.0
20200318  6   7   8  6.0   2.0
20200319  9  10  11  0.0   2.0

In [84]:
df2.isnull() # 查看空值

              A      B      C      D      E
20200316  False  False  False  False   True
20200317  False  False  False  False  False
20200318  False  False  False  False  False
20200319  False  False  False   True  False

In [86]:
np.any(df2.isnull()) # 至少一个na返回true

True

In [88]:
np.all(df2.isnull()) # 所有的值为空值的时候返回true

False

## 5. Pandas读取及写入文件

In [121]:
file = pd.read_csv("people.csv", encoding="gbk")
file

   地点  名字      职位     工资 在职情况
0  北京  小红  渠道合作经理  15000   在职
1  北京  小明    行政专员   8000   离职
2  北京  小白    行政专员   9000   在职
3  上海  小绿    商户经理  12000   在职
4  上海  小黄    商户经理  10000   离职
5  上海  小黑     团队长  12000   在职
6  广州  小紫  渠道合作主管  20000   在职
7  广州  小粉  渠道合作主管  20000   在职
8  广州  小青      经理  10000   离职
9  广州  小蓝     团队长  13000   在职

In [122]:
file.iloc[3,0] = "成都"

In [123]:
file.to_csv("people2.csv", index=False)

## 6. Pandas数据合并

In [126]:
df1 = pd.DataFrame(np.arange(12).reshape((3,4)), columns=["A", "B", "C", "D"])
df2 = pd.DataFrame(np.arange(12,24).reshape((3,4)), columns=["A", "B", "C", "D"])
df3 = pd.DataFrame(np.arange(24,36).reshape((3,4)), columns=["A", "B", "C", "D"])

In [140]:
df4 = pd.concat([df1, df2, df3], axis=0, ignore_index=True) #纵向合并， 并且重建index

In [141]:
df4

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
5  20  21  22  23
6  24  25  26  27
7  28  29  30  31
8  32  33  34  35

In [149]:
df1 = pd.DataFrame(np.arange(12).reshape((3,4)), columns=["A", "B", "C", "D"])
df2 = pd.DataFrame(np.arange(12,24).reshape((3,4)), columns=["A", "C", "D", "E"])

In [155]:
df5 = pd.concat([df1, df2], join="outer", ignore_index=True, sort=True) # 合并两个表，填充Na

In [156]:
df5

    A    B   C   D     E
0   0  1.0   2   3   NaN
1   4  5.0   6   7   NaN
2   8  9.0  10  11   NaN
3  12  NaN  13  14  15.0
4  16  NaN  17  18  19.0
5  20  NaN  21  22  23.0

In [159]:
df6 = pd.concat([df1, df2], join="inner", ignore_index=True) # inner只会合并共有的值

In [178]:
df7 = pd.concat([df1, df2], join_axes=[df1.index], axis=1)

/root/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

In [179]:
df7

   A  B   C   D   A   C   D   E
0  0  1   2   3  12  13  14  15
1  4  5   6   7  16  17  18  19
2  8  9  10  11  20  21  22  23

In [3]:
import pandas as pd

In [6]:
cet = pd.Series(["四级222", "无", "六级", "四级"])
bx = pd.Series(["90", "20", "10", "1"])

In [9]:
df = pd.DataFrame([cet, bx])

In [13]:
df = df.T

In [21]:
cet4 = 0
cet6 = 0
fail = 0
for i in df[0]:
    if i[:2] == "四级":
        cet4 += 1
    elif i[:2] == "六级":
        cet4 += 1
        cet6 += 1
    elif i == "无":
        fail += 1

In [22]:
print(cet4, cet6, fail)

3 1 1